<details><summary> for projects_test1_environments_staging 2024-05-30 11:09:29 (UTC)</summary>
    <details><summary>Locking successful</summary>
  Project diggerhq/quickstart-terragrunt-aws#projects_test1_environments_staging has been locked by PR #2
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.example will be created
  + resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "my-tf-test-bucket2"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "Name"        = "My bucket staging"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "Name"        = "My bucket staging"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>

</details>